{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Lambda", "config": {"function": ["YwIAAAACAAAABAAAAFMAAABzHwAAAHQAAGoBAHQAAGoCAHwAAGQBAIMCAGQCAHwBAIMBAVMoAwAA\nAE50BQAAAHVpbnQ4dAsAAABudW1fY2xhc3NlcygDAAAAdAEAAABLdAcAAABvbmVfaG90dAQAAABj\nYXN0KAIAAAB0AQAAAHhSAQAAACgAAAAAKAAAAABzMwAAAC9ob21lL21hcmNvL1Njcml2YW5pYS9U\nRU1QL2tkZ2kvYnVpbGQvcHkvYWx1dGlscy5weXQIAAAAX29uZV9ob3QvAAAAcwQAAAAAARgB\n", null, null], "name": "lambda_1", "dtype": "float32", "trainable": true, "function_type": "lambda", "arguments": {"num_classes": 3}, "batch_input_shape": [null, 15], "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "dropout": 0.0, "stateful": false, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow"}
